{"business_id": "IkilcGqiN3_sQk-VvnoAeg", "stars": 5.0, "text": "Le Vin Papillon was not my first choice. I really want to take my friend to Joe Beef but could not get a reservation. How can a restaurant that has a menu focus on seafood and vegetable satisfy my meat loving friends?!  Le Vin Papillon has no reservation policy. Best to arrive early! Arriving before 5 pm would guarantee a table if you are a small group. This is a more intimate restaurant with limited seating, especially during winter when the back patio is not available. Make sure everyone in your party here on time as you won't be seated till then!  Our friends arrived late and we ended up having a drink at the bar. I would have just have my dinner at the bar area as the bartender is super friendly and cheerful and I can just order all their regular menu. If you are a wine lover, you won't be disappointed with their wine selection.  Everything on the menu is EXCELLENT! Their waitstaff just AMAZING! We ended up doing a Trust your waitstaff style.   The famous Cauliflower with chicken skin and the Smoked Carrot Eclair were just amazing! Vegetable dishes for the meat lovers. Duck Fat, Chicken Skin, Bacon Fat were used to add flavour to all the dish. Interesting flavour, texture and definitely not what my friend expected!  Our waiter ask if we want some more?? Of course YES!  Celery Root? I was doubtful but now I am a believer! Perfectly seasoned Beef Tartar hidden underneath some greens? Sturgeon with Squid Ink Puff Bread?  Our waiter asked if I want more? I do but sadly my friends said they were full  I have now been to all 3 chef Marc-Olivier Frappier's restaurants in Montreal. They are all consistent in service and food quality. The price point is quite affordable for what they offers. But Le Vin Papillon's offerings is just so unique and great for seafood lover like myself. Now I do have a second thought about Joe Beef being my favourite restaurant in Montreal!"}
{"business_id": "I6oxEn1HT41S2GPrDKPPvA", "stars": 1.0, "text": "Perfect Chinese Restaurant has been around for ages, even decades!   It is far from Perfect but as a 24 hour business it does survive because where can you get some Chinese food in the middle of the night in Scarborough? But... for sure Perfect will not be the place for me... can I say I rather going to bed on my empty stomach?   Prices here for dim sum is dirt cheap $1.50 for all sizes All Day weekday and weekends are $1.80. The specials are from 7 AM, great if you have to work early..   I don't expect much services in cheap Chinese restaurant. I can live with servers throwing things on our tables. I can stand the plastic table cover where all my plates are sliding everywhere. I can understand that the quality of food will not be as good with the price they are charging! What I cannot stand is lukewarm to room temperature dim sum!   Shrimp Rice Roll - not only cold, the shrimps inside was like hard.  Pan Fried Turnip Cake - cold and oily.  Chicken Feet - lukewarm  Siu Mai - lukewarm  Har Gor- The only one that is tasty and hot   Now I am more than happy to pay more at other dim sum places at least I know my food is hot and steamy.. and I can even complain to the manager if they are not up to par...  1.5 stars with 1 star goes to the fact they are open 24/7"}
{"business_id": "q9_gLvTNf11etVxbH7JY0Q", "stars": 5.0, "text": "If you looking for a real sushi experience, go to Yasu.   If you just want to eat salmon sashimi till you full, there are tons of ayce places you can go to on Bloor St.  I am just happy that Ouchi San decided to open Yasu. I have been to his previous restaurant Nigiri-Ya at Leaside it was good but not as good as what he is doing at Yasu now. $80 seems to be steep for sushi but trust me the experience more than worth it!   Fresh fish and seafood from all over the world including Japan, Europe, North America. Each fish is featured as a piece of art in nigiri sushi with just the perfect preparation method and condiments (fresh wasabi, soya sauce, yuzu salt, shiso, ginger....)   Procedure:  - watch the preparation - listen to the explanation - admire my food - smell my food which will further enhance my experience - use my hand and put it my mouth and eat slowly and just let my taste buds dance - making happy noises and smile - Repeat  I was sad that I miss the fresh  Hokkaido Uni but seriously Aburi O-toro, Ankimo, Hokkaido Scallop even Mackerel tasted so good...  I will be back.. I want to be back...   When am I coming back? (let me go check their availability on Yelp reservation!)"}
{"business_id": "pDMxIQoqkZJeUe2r8XIVKQ", "stars": 1.0, "text": "Kim Dinh is up at McCowan and Bur Oak in the same plaza as Sobey's.  I ordered a Large Pho with raw beef and tripes.   The soup was not hot!  The soup was super salty! (I was thirsty for the whole evening after eating this! tons of MSG!) The noodle was the dried type! (and not really prepared well) The raw beef is really quite raw.. but not because they want to prepare it that way, just because the soup is not hot enough to cook them properly! The tripe was the worse part of the meal.. It was in big chunks and just throw on top of the noodles with no preparation. Just like something they just got from the open tub from the Chinese supermarket!   They really not specialized in vietnamese cuisine.. There are thai, malaysian dish in the menu.   No lunch Special!  They accepts VISA and MC for orders over $10"}
{"business_id": "q4QuS-MaVSXbIFkUZlxZ9g", "stars": 1.0, "text": "I don't give a business 1 star that often. As I believe there must be something good in everything. However, Win's Seafood Restaurant makes me feel like giving them not 1 star but 0 star! I will never go back there to eat for sure!  Win's Seafood Restaurant used to be an AYCE Japanese restaurant and then it becomes an AYCE Hot Pot.  Not much changes as they kept the same layout with little renovation done. The built in hot pot stove still on our table.  The menu items they offer are quite unique. Not the usual dishes as other Cantonese restaurants. There are also tanks of fresh seafood of fish, lobster, crabs and shrimps where you can order by lbs.  The restaurant was quite busy when we arrived on a Sunday 9 pm. Almost all tables were filled. We got seated promptly. we decide to order 3 dishes:  - mushroom with diced sirloin beef - mixed veggie with fresh soy and mushroom - Sunny Chicken  The only dish tasted good was the veggie dish because it is the only one that is not burnt!! The beef was so dried and some of the mushroom was black. This dish cost $14!! and it is one of the worst food I have for a long long time...  The chicken. It was charred in some of the pieces. I complained to the waitress right away. She said those are just black bean sauce, not burnt... ok so we tried eating it.. yes the chicken is burnt, dried and tasted bitter. I told her I know how burnt tasted like! I asked to speak to the manager but he just ask the waitress to tell us that it is the way it suppose to be! For sure I am not eating that! They offer to replace with the same dish.. I really don't have faith in anything that comes out from this kitchen anymore, I just ask them to cancel the order.  When I asked for the bill, and the total comes to $30, so I left $40 waiting for the change. I wait and wait then finally ask where is my change? The waitress said I never pay any money! Gee! And then she asked me who I gave it to?!! Of course one of the staffs took our money... Then after looking around for awhile, they finally found my $40.  Lousy food! Bad and Unfriendly Services!  I don't think I will be back again!"}
{"business_id": "WivZPC3bKDWpu_pGhvK10w", "stars": 1.0, "text": "Chicken and Noodles Chinese Restaurant has been in Scarborough for over 20 years.  Compare to other chic, nicely decorated restaurant, Chicken and Noodles really reminds me of Chinatown.. or places back in the 80s where disposable plastic covers were used as lining on the tables, people going to Chinese restaurants because the food is cheap and one can expect to be served by waitstaffs that has quite an attitude.  The menu has quite a vast selections of Cantonese/Thai/Malaysian/Japanese inspired dishes... I don't know if that is good or not....Everything here is cheap... comparable to food court prices. Wonton Noodle soup for $3.95 is not easy to find up at a sit down restaurant anymore. A Hanoi Chicken with rice combo that comes with soup and rice for $6.95. Taiwanese Beef Noodle soup for $4.95.   Mon- Fri they have specials when you order over $25 before tax, you get half of their famous chicken for $1. That for sure a bargain if you are eating with a group.  I ordered the shrimp dumplings noodles soup ($3.95) and chinese broccoli in beef brisket sauce ($3.95). The vegetables arrived first.. such a big portion, I feel full even looking at that.. The noodles though I found the shrimp dumplings are really tasty stuffed with tons of shrimps, however the broth is quite salty... (full of MSG??)  Found here everything is sticky. The outside of the condiments bottles are sticky, the menus are sticky...  The floors are sticky .....OK I am grossed out...  Sorry I won't be back... Please don't ask me to go back!!  Though, the place is fully packed for lunch on Friday with No lunch Specials.  Cash Only!"}
{"business_id": "wP8yCVWN2sC5_fYMMVvpDg", "stars": 5.0, "text": "Best store bought dumplings you can find! I love to have them in my fridge for anytime when I want to have some dumplings. I do think they are better than the one I can make myself at home!  I love any of the ones with chives/leek.   I just have some for lunch today and you will see me loading it up especially during winter season."}
{"business_id": "w9pwbsusI9DI637UYqMctQ", "stars": 5.0, "text": "Blood Brothers Brewing is worth the trek to at least a visit.   I have been drinking Shumei and Paradise Lost for awhile which are available on taps at Good Catch Boil House. And here I was, finally here and able to try out more of their beers!   You can either order a sampler or a half pint or a pint from their ever rotating draft list. And in case if you rather just want to pick up a bottle or 6 of them from the shop, you can also ask for a taste before committing.  If you are into sour beers, you would be delighted with their interesting IPA, Sour Ale which used different kind of fruits. And their Sour Ale White Lies series uses different grapes was also quite interesting too.   Come by for a drink or 2 and enjoy their casual setting with friendly service and of course some good beers!  PS. You can even order bottles delivered to your place via their online shop."}
{"business_id": "K4amkYh0AkUJwBRVLNDLrw", "stars": 1.0, "text": "They are CLOSED!"}
{"business_id": "EEIz44ewHhOKmfTloAK13g", "stars": 5.0, "text": "I have to thank chef Patrick Kriss and front of the house Amanda Bradley for bringing World Class fine dining experience to Toronto!  As someone that travel to eat, I had been planning most of my oversea trips around Michelin starred restaurants: Osaka, Hong Kong, Macau, Chicago, New York... Toronto as one of the major cities in Canada had also been lagging behind Montreal and Vancouver for Higher End, Michelin's worthy dining establishment.  Until Alo opens its doors back in July 2015.  Planning - Reservation  Reservation can a challenge but worth your effort. Plan accordingly as Opentable reservation is available 90 days out. I was planning to visit Alo as a solo diner but one of my friends was kind enough to join me so I can have the opportunity to try out every offerings on Alo's Tasting Menu.  Tasting Menu  Everything is seasonal. I recommend visiting in different seasons to appreciate what Alo's team offers. For 2 people, I would suggest ordering one each appetizers, main and dessert. Presentation was top notch! Pleasing for the eyes and so colourful too! Every dish was a piece of art.  And of course, we all let our cameras eat first and took some photos!  We ordered some tea to go with our desserts. 9 different kinds of Solane Tea is served here! You can even smell them before ordering!  OVERALL IMPRESSION  A combination of interesting taste profile and texture. The whole meal did take almost 3 hours so hopefully you like your dinner mate. Service here is top notch. The hospitality team (front of the house) is just amazing! Attentive and polite: a 5 star dinner service!  Will I be back?! Yes, in a heartbeat!  My meal at Alo Restaurant is one of the most memorable meals I had in Toronto.  PRO TIP  If you want to have a taste of Alo Restaurant without making a reservation, the best is drop by their bar area for a drink and a snack. The bar at Alo Restaurant has this relax and chill vibe which is great for pre or after dinner drink!"}
{"business_id": "4WmI1fnjvfI5OyV1B6emAQ", "stars": 1.0, "text": "A moment of weakness: as it was close to midnight and almost everything else in the plaza were closed and after eating Double Inferno earlier, I don't think I should be having more spicy food! And I made the wrong decision to come to New Choice Restaurant again.  I guess I should have learn from my own experience and read my own review using my Yelp App before walking through the doors... but New Choice is open till 4 am.. it cannot be worse than my lunch special...  I was WRONG!  The only thing that I enjoyed was the Plain Congee ($1.50) in its purity with no added seasoning or ingredients... I was just so glad we ordered that and we even order another bowl!  I have to declare I have the worst Taiwanese Three-Cup Chicken ($9.95) in my life, where's the 3 cup -  each of soy sauce, rice wine, and sesame oil and where's the ginger and basil? Why are the chicken so heavily battered deep fried and gluey? After one bite, I just couldn't eat that and I thought I ordered the wrong dish! You sure that's chicken?!  I confirmed with the kitchen again and he said it is the 3-Cup Chicken!!   Taiwanese Style Stir Fried ($5.95) was as bad. The tofu was deep fried to crispy dryness. At least I enjoyed the peanuts as it went well with my congee.  After the renovation, the interior does feel cleaner.  Note to self, I am not coming back here again!!!!!!!!"}
{"business_id": "XzbKe4I0dfKAFt9LSLX3xw", "stars": 5.0, "text": "Usually when I want to celebrate special occasions but want to stay up in the suburbs without going downtown, I go to Octagon.. But after dining here at Terra Restaurant, I am so impressed and now it becomes the Go to restaurants if one want to celebrate or impress!!   Classy, Chic and Modern decoration.. good for all occasions. Service was excellent! One of the best I have, attentive, helpful and professional.   The main though pricey..but all nicely done.. and so delicious!!!   Baby Arugula Salad ($14.95)  - Our waiter split that in half portion for us to share... (Maybe I want to have the salad all for myself! :P) - Light vinaigrette dressing with blue cheese and caramelized walnut.. I love walnut!!   Lime Sherbet was served to clear our palate, before our mains:   Grilled Bison Tenderloin (8oz) with Foie Gras ($44.95)  - Waiter suggest how the meat best to be cook to medium rare...which is my preference anyway  - really lean but so tender.. not gamey at all.. and nicely filleted finished off with a balanced gravy  - Foie Gras.. exterior seared and Mmmm good (I ate that whole tiny piece since my DC is not into that!)   Grilled Mixed Seafood ($37.95)  - Waiter suggest the fish to be cooked medium  - Salomon, sawfish, cod, tiger shrimp, big scallop, king crab, squid just to name a few  - All of sampling portion, lightly seasoned!!. and all fresh and tasty.. I would have a hard time if I force to decide if I only allow to order just one!!   Cheese and Cracker served while we decide on dessert :  While reading the dessert menu, I am so impressed with the loose leaf tea selection ($3.95-$14.95) they have.. One of the best I encountered in a sit down restaurant aside from a tea house.. And all of them according to the menu description are whole leafs tea!!   French Press Coffee ($3.95)  - A little weak and watery.. I wondering if they have a stronger brew.. I ended up drinking the coffee black.. though it smell really good  - Terra should have a more extensive coffee menu...   Warm Flourless Chocolate Torte with Ice Cream ($11.95)  - I am glad that I decide to order ONE dessert to share.. it is sizable and I barely able to finish my half portion  - Rich and chocolaty and fluffy and light at the same time! Heavenly Good!!   Terra is not cheap!! I definitely think it is worth the price tag. At least the food is really good, reasonable portion and excellent services... I will be back... especially if there is another group buy deal again!!  Now guys you know where you should take your date.. hint hint! Or you can always come for a night cap and dessert!!"}
{"business_id": "cWZl0jdkJI8O7XBRIWPOPw", "stars": 1.0, "text": "I really love the idea of The Relish of Chengdu: a business that replicate the cuisine of Chengdu in GTA.  The business is small with limited items available but it is just like home cooking.   Their hot sauce is spicy with a nice flavour....  But why the 1 star?   I got this Szechuan Cold Noodes ($4.99) and I found a piece of hair in the sealed package of noodle......"}
{"business_id": "5paJ02eNpdJOX8TffqdzYg", "stars": 1.0, "text": "They are CLOSED!!"}
{"business_id": "s-S2xzhmyWw7TUDet7WBnQ", "stars": 5.0, "text": "Finally something interesting happening down at Front Street!   I love the set up! The Popup vendors! Just the whole idea and concept and it is well executed! Here you can get a snack, a drink, a full meals from some of Toronto's most popular business/restaurants and some of them don't even have a store front!  Price might be a little more than getting from the original store but you can get everything here! Tacos from Mad Mexician, Burger from Holy Chuck and especially the over hyped Uncle Tetsu Cheesecake  was served as individual portion and no line up when I arrived around 10:30 am.   There is also a nice seating area with entertainment.   This is better than any food trucks or any of the gimmicky events I been to that required an admission fee and it will be here till end of September!  Too bad Toronto's summer is so short! Enjoy the experience while you can and hopefully this would be a constant yearly event from now on!"}
{"business_id": "-mF_pjHDweFE3kh8yiMatw", "stars": 5.0, "text": "Epices de Cru is wonderful spice store.  Of course I am so happy to browse and sniff all their offerings. If you love to cook, you won't be disappointed with the varieties they offers! So many spices and herbs to choose from and just checking them out gave me a lot of inspirations!  Epices de Cru is also a tea shop.  A whole wall full of loose tea leaves in tins. You can buy them in small package which the staff will pack them for you. The lady that served us was really knowledgeable and helpful and is a real tea sommelier. Their selection is from all over the World and they have interesting offerings from smaller tea plantations. You can also buy a hot tea to go brewed from one of the tea leaves!  This was a highlight during my recent visit of Marche Jean-Talon. So if you love tea, spices and herbs, make sure you drop by Epices de Cru!"}
{"business_id": "JrVL_k7lcK93r3vfFeYbUw", "stars": 5.0, "text": "I have no will power when it comes to pastry from The Danish Pastry House.  I am lucky I am not working downtown or pass by Union Station everyday. I can imagine myself eating at least one of their pastries everyday. They are just as good or even better than the pastry I had from Copenhagen.  I did get 3 last time I visited and they were just so good and I ate them with no regrets.  Flaky, buttery and light! I do prefer the less sweetened ones but they have so many different varieties to choose from.  Perfect treats to go with coffee. And they have their own Kontra Kofee from Denmark now in this location."}
{"business_id": "Kxop0nGA-BUrwYD4EGhyPA", "stars": 1.0, "text": "I would have give Chinese Traditional Bun a 3 star.  The floor is sticky..but is ok, I am not eating from it..  The deco is plain and non existent, but is ok, I am not eating that  The food is decently good made fresh.. and I have fun with a group of my fellow yelper..  The dumplings are all made to order, served fresh and steamy hot!!  But why 1 star??   Not only the ready made buns were lying around exposed and that lady that making the dumplings in the storefront didn't even bother washing her hands after she finishing using the bathroom...  If I didn't witness.. I would say ok... anything can happen when I am not looking..but.....  GROSS!!"}
{"business_id": "9CJGlFmrHBt9htRv6on32A", "stars": 1.0, "text": "I don't know how to make a Cappuccino myself... but I drink enough to know what a good one tasted like.. or how it suppose to be made...   I. C. Coffee House is the worst one I ever drank... even from home baristas... and he supposed to charge people money for that??   Espresso was off!! It was like drip coffee...so watery...  Milk was not steamed hot enough to produce any milk foam (advice get a temperature gauge) the barely hot milk does not have any texture and have no firm foam...   I was basically drinking a drip coffee with some light foam on top.......   I need to go to Indie coffee shops downtown to have my espresso fix NOW!!  Why there is NO WHERE to get something half decent in the area!  No only the drink suck, the environment is not comfy... though they do have free WIFI...    I might have to stick with Starbucks when I am up in Markham.. at least I know what to expect!"}
{"business_id": "BtLDbNfpwdwHSmyBJF2-RQ", "stars": 5.0, "text": "Sarpa is awesome! It is located in Oak Ridges.. yes that's really really up North for downtown people... even for me this is an area that I hardly visit. But it really worth the drive for me if I have the cravings for some good Italian food and great services!!   The deco is elegant and warm. Most furnishing are in dark mahogany wood. The lighting is dim and is kind of romantic... great dating spot.   Sarpa has a daily menu specials or you can pick from their regular menu. We decided on:   Organic Arugula Salad ($13) though pretty good, but didn't wow me, skip!   Veal Parmigiana ($24) is one of the best veal I ever have! Pounded really thin and lightly breaded, surprisingly tender and favoured.. oh and the melted Buffalo mozzarella ! Delicious!!   Linguine Frutti Di Mare ($28) has really fresh seafood, all cooked perfectly with a light touch of tomato sauce.   Chocolate Torte with Vanilla Gelato ($10) was so heavenly... I love warm chocolate sauce and cold gelato..........and finished off with assorted fresh berries!!   Sarpa has the nicest, cleanest and the nicest smelling washroom facilities I ever been to!! Even Ritz Carlton's washroom is no match to this place!   Sarpa is an awesome restaurant to bring a date or even having dinner with your friends.... I can wait to go back!! BTW, they have lunch specials too!! :)"}
{"business_id": "G24p1oGGfY3t-m8Z2lPCaQ", "stars": 5.0, "text": "I have been wanting to have a Kamayan Feast with my friends all these time. Thanks for Elvis A 's invitation, I finally have my first experience at Tinuno!  Reservation is essential as this place is really popular. The evening we were there, there were 2 large groups of 20! And walk in would be turned away.  Kamayan means Hand to Mouth and it is a feast for special occasions. I find it fun to eat with my hands and make a mess. You do have an option to wear gloves if you rather not to handle your food with bare hands (no judgement!)  Tinuno's Kamayan Feast consist of solely food prepared from the grill, seems like the menu is simillar: Fish, Stuffed Squid, Pork Belly, Pork Skewers, Shrimps, Mussels, Okra, Egglplants on top of Garlic Rice and with a side Mango Salad.  Mango Salad and Garlic Rice are both available for refill. And I love the tartness of the salad! It just gave me the will power to eat more!  Minimum order for 2 so bring your friends! More the merrier. The food is good as everything is grilled so not too oily aside from the pork belly and love the grilled taste!  Thanks Tinuno for offering the Kamayan experience as such a reasonable price! At $15 it is just an amazing experience! And the best thing is Every Night is a Kamayan Feast and thus every night is special occasion at Tinuno!"}
{"business_id": "j-w4K1ZbZJw1M9Z-CauFzA", "stars": 5.0, "text": "Love the set up of Lake Wilcox Brewing's Brewery Pub!  Bright and spacious! Just so enjoyable to have a drink right at the bar or in one of the communal tables.  Have a sampler flight or even a pint in their tap room. Here you will find their usual beers which are available at LCBO. I personally would recommend giving their Small Batch Limited Release which changes regularly a try.  And the best part is to pick up some cans and fill up a growler right here directly at source. You cannot get more local than this! And there is not too many local brewery in the area.  Check their instagram feed for the most updated specials and events. BTW there is usually freshly shucked oysters available on Saturday from the Cannon Oyster Co and lunch service from Thursday to Sunday."}
{"business_id": "6fd9EIo9TAFvJLkfC7_qYA", "stars": 5.0, "text": "No lines!! No one!! Love this L'Avenue location.  We were seated right away for breakfast brunch on a weekday.   My friend willingly to share an order of Egg Benedict with me. Thanks so much! I still have nightmares about my last visit when no one wanted to share anything with me and I ended up being so stuffed and could not even think about eating until dinner time!  Love the option for a split order with an additional $2.50 charge, you can have your own fruit skewer and potato.  Everything was perfect from the food to the service.  A truly 5 star experience without the price tag!"}
{"business_id": "54wCYFNFs1jh3mx6cS4sSg", "stars": 1.0, "text": "Le Pain Quotidien went out of business... a bankruptcy notice displayed on the front door....."}
{"business_id": "qgB0b1SgA8TRC72bryxuhg", "stars": 5.0, "text": "This is time to write an update for Zen before they move to their newest location in Markham for Spring 2015.  I have been to Zen numerous time for lunch and every time was an excellent experience.  Since I always come here alone, I definitely suggest to just sit right at the sushi bar. It is so much fun to interact with the chef and watch them prepare sushi like a work of art.  Lunch menu is still great value with the quality and quantity of the food. During lunch, you can also order from the full dinner menu or even their omakase sushi.  I will be coming here for my Japanese food fix whenever I can to tie me over till my next trip to Japan!"}
{"business_id": "rbjai2nr328YBuCOjt_6iQ", "stars": 1.0, "text": "Although Boston Steakhouse is a steakhouse, please don't ever go there if you want to eat Steak.  This is a really HK style Western food. They charge a really low price but their steak are not good cut. The meat are all marinated in baking soda so it suppose to make the cheap cut meat tender.  The steak are all served on a hot sizzling plate and they pull the sauce on top right at your table. And the smell does get in your clothes and your hair...(my dog loves me after I have dinner there :3 )  The set lunch and dinner are priced good... $6.95 or so that comes with a HK style Russian Borscht soup (which sometimes they water down if they are busy and they did not prepare enough soup) and drink."}
{"business_id": "e7hLWm0qh_2b__dLx49r9g", "stars": 5.0, "text": "The BEST butter tart I ever have!   The Maid's Cottage's butter tarts are just so good! The crust so flaky and buttery! The fillings so smooth and silky like melted caramel!   I ate mine so fast while my Yelp friend kept admiring his! I almost want to grab it from him and just eat it!!  I can eat a half a dozen of these tarts with no problem...until I find out their calories and sugar count. How can these little delicious pastry so unhealthy but this sinfully indulgence is worth every single calories!  4 different flavors to choose from Plain, Pecan, Raisin and Currant at $2.25 each.  The bakery is located at the back on the store, facing Newmarket Community Centre with ample parking around the area.  The Maid's Cottage now is my must visit stop next time I am up in Newmarket!"}
{"business_id": "qGL7Z0yVXET7GTq-mNyQmQ", "stars": 5.0, "text": "When I drove by The Sushi Bar http://www.yelp.ca/biz/the-sushi-bar-toronto?hrid=Smn0s558wjG12xSw7qNoTw#src:self one evening and saw a huge For Lease sign up, I just don't believe my eyes! How can my favourite Japanese place be out of business.. Then I happily realized they moved to a new location, just 3 doors down... And of course I need to come here for a visit!  This review might be a little bias as I never even ever look at the menu whenever I eat at The Sushi Bar. Just show up and sit at the sushi counter and just eat whatever served to me.   And now I can even drink my sake here?! I just love this new location, so spacious and nicely decorated.   There are quite a few sakes offers here and some even not on the menu.   Chef looked at me looking at the Sake menu, he said Hot or Cold? I said Cold and the pretty waitress just shown up mysteriously with 3 sakes for me to try... Just like magic!   Wakatake Onikoroshi Junmai Daiginjo Demon Slayer Taiheizan Junmai GinjoChogetsu Denshin Yuki Junmai Ginjo  And the winner today is Taiheizan Junmai GinjoChogetsu  Food then mysteriously served to me and I ended up eating non stop for 1.5 hour until he finally asked if I am full....  any dessert.. How I love this man..  I definitely will be back again and again... My new drinking hole...  Food served omakase style is all seasonal so I always come here to eat with an open mind and empty stomach! Just Feed me!"}
{"business_id": "SN0-O-CuIsyZf3LGZVEUAw", "stars": 5.0, "text": "I was at The Sushi Bar eating at the sushi bar on a Saturday night sushi outing!   The Sushi Bar is just south of Shinobu which we walked by last Sunday. It is really small, has table for around 10 customers and when I got there at around 6 pm, no tables available so I was asked to sit at the sushi bar!   The menu is quite standard.. rolls, maki, sushi, udon... They do have another special menu that is changed seasonally...which is not published online.. But tonight I have a special special menu that is the Chef's choice.   When a single customer seated at the sushi bar asking the Chef what's good to eat? It for sure and exciting experience for both the chef and the patron.   Miso Soup ($2)  - A OK with tons of tofu and wakame seaweed   Salmon Tartar ($9)  salmon. spicy mayo with tempera bits finished with balsamic vinaigrette .Tempura bits tasted like rice krispies.. with tons of bit and texture... not soggy at all...   Osaka Sashimi ($17)  - salmon, butter fish, yellowtail, tuna all nice and fresh. Tuna really good cut with melt in the mouth texture  - Special surprise are the octopus marinated in 4 different ways.. which all has their different texture, character and taste   Baked Seafood in Shell (Chef's special)  - big scallops, squids, crab and various seafood mixed with a lemon seasoning with light cheese on top  - oh so yummy!! fresh seafood and prepared by one of the waitress right in front of me   Uni and Salmon Roe Sushi (Chef's special)  - Both so fresh and yummy. Always good to have sushi chef makes what the freshest of the day for you!   Red Bean/Green Tea/Black Seasame Ice Cream ($3)  - When I was deciding which one to pick, Chef said I can try them all!! Hey he really knows what a girl think! :)   All the staffs here are so friendly and nice! I feel like I am at a private kitchen when I can talk to the chef while I am eating! They kept checking to see how I like the food and if I finish them all. I would never let any good Japanese cooking to be wasted!   Until next time.. and since we are now on first time bases.. I can't wait to go back and try some of his Chef's offering!!   They accepts Mastercard and Visa!"}
{"business_id": "uvWcsnk8cnSzQg9_SQaFsA", "stars": 5.0, "text": "Babu, I drove by you all the time.. I never even give you a second look because there are Thai/Vietnamese, Cantonese restaurants, Subways, Second Cup.   Babu you even tried to deliver me flyers with discount coupon to my mail box thinking I will jump to take advantage of the $5 off.   Luckily, fellow yelpers show me the light... After reading all these positive reviews, I am so curious.. What makes you so specials?  Saturday at 7:00 PM. The parkings in front of the store are all full.. Really all these people getting take out for a Saturday night?   There are 2 different lines when you enter the store, one on the left is for  express (bread, cake, sweet) one on the right is for regular order. It is so bright and modern inside. All the stainless steel counters are sparkling clean and a huge open kitchen at the back.  Menus with prices are all in the lighted boxes overhead. There are so many choices! I have so little experience with Tamil dishes, ok this is really my first time I been to one!! I am not good in dealing with choices... All the food are labelled with number of pepper to indicate the degree of spiciness.  I am lucky to have one of their friendly and smiling staffs to the rescue. Shari is so patient! I told him I want something really spicy. He let me tried the Chicken Hakka..hmmm yes... tender and spicy. Then he let me tried the chicken curry ..hmmmmm yes tender and spicy too!  I decided on the Chicken Hakka Combo for $6.45 that comes with rice and 3 choices of vegetables! Gee I have to choose again?  For rice I decide on brown rice that is a easy choice. However for vegetables there are more than 8 choices: pickled eggplant, creamy eggplant, colland, curry ladyfinger, pea with goat cheese, curry veg, stired fried veg, mushroom in curry... choices choices choices.. Again Shari let me tried anything I have doubts. I like most of them, so I ended up asking him to pick for me!  Then to the 2 big sweet display cases ... What to pick, what are all these!!! They should have label them! I don't know what they are and none of them have names... I ended up asking Shari to pick some for me...  The food I got for under $10 can really feed 2 people!! They all tasted really good! The staffs here are so helpful and friendly. I will definitely be back to try out other food on the menu..  Thanks fellow Yelpers!! I really value all your reviews!  They accepts Visa, Mastercard, Amex and Interac.  There are also daily specials on weekdays."}
{"business_id": "otsjAjxf0PNQ99xcmuj_LA", "stars": 5.0, "text": "What's better to express my love of Japanese food by attending a Sushi Making class... When my Yelp buddy told me about Sushi Making for the Soul, I am IN!!   Sushi Making For the Soul ($30) is not only an opportunity to learn about the detailed and intricate art of sushi-making, it's also a way to help those affected by the earthquake and tsunami in Japan.   The event took place at Liberty Noodle which was really informative and it was so much fun with hands on sushi making that resulted in sushi that only myself enjoyed eating...(Think how it is in a kid's handicraft class!)   Master Sushi Chef, Shin Aoyama, and Sushi Impresario Sang Kim did a wonderful job in making the evening entertaining and enjoyable... After attending I now know some basic history and knowledge about sushi and I know how to roll up some rolls just like a Master Sushi Chef.  The good thing is the proceeds are directed to Doctors Without Borders, Second Harvest, and the Japanese Red Cross.   Future events are in the making.. and they going to have a single event... What's better to get to know other singles that are interested in sushi and get to know each other with Shari rice stuck to the fingers!"}
{"business_id": "qgB0b1SgA8TRC72bryxuhg", "stars": 5.0, "text": "Can I come here for lunch every week? Zen Japanese Restaurant is good as it get for an authentic Japanese food at a reasonable price!  The lunch menu has over 20 different selections starting from $9.99! It is a good deal as it is half the price they charging for dinner.  We arrived at 12:00 PM without reservations... we were lucky to have a table for 2.. the only table for 2 in the restaurant. Yes seriously, they are turning away people without reservations. Even the Sushi bar was packed with people during lunch! I will definitely make a reservation even for lunch time!  We ordered the Chirashi ($13.95) and Sushi ($10.95) lunch set. The Chirashi set does come with a Udon and house salad. The fish so fresh, even the salad is nice and fresh...not soaked with salad dressing! The Udon is chewy with texture... The rice they use are the smaller Japanese sushi rice. The seaweed on the rolls are crispy and with good flavour! OK OK! WE LOVE IT!!  We already want to come back next week for lunch to try out other items on the menu!   The only minus is the service can be spotty because of place was packed!  Reasonable price for lunch with excellent quality of food!!  Closed on Monday! They accepts all Credit Card!"}
{"business_id": "It6NGNfebuF5j3KrXoi-IQ", "stars": 1.0, "text": "Taste of Origin is the third restaurant that opened up at this location within a year or so.... And unfortunately I don't think they would stay open for too long if they don't improve the quality of the food and the services...  My friend was really hungry.... and when someone is hungry, everything should taste good... at least decent... but   Pickled Duck Feet ($4.99) - We originally ordered Wasabi chicken feet...but after waiting for 20 minutes, the waitress informed us they all sold out?? and she suggested duck feet instead....20 minutes to found out that something precooked are sold out???  - Really really bland tasting!! Practically tasted like just cooking in boiling water and just let them cool down and serve... - My friend said her mother can made them better at home...maybe I should just eat at her house!  Original Handmade Noodle with Fu Zhou Fish Balls ($7.99) - My friend said my cooking taste better than this bowl of noodles... need I say more? - Fish ball was undercooked, noodles was undercooked really hard and chewy.. and the soup was tasteless - $8?? with 3 fish balls that tasted like from the freezer of a nearby Chinese supermarket??? and just handful of noodles? Maybe it is good since it tasted so bad...no point to get plentiful of bad food.....  Taste of Origin has this Cantonese and Fu Zhou menu.. which can be really interesting since if you are a seafood lover, you would love the selections of  Fu Zhou's seafood.   Sadly I don't think I would be coming back to try them out.again..."}
{"business_id": "TJresValKB2aHcmrwNEskQ", "stars": 5.0, "text": "When I walked into Djerba la Douce, I saw a hint of dismal in one of my friend's eyes. I know Djerba la Douce does look a little sketchy both from the outside and the inside and this definitely not places he would have frequent.   With no decoration, no air conditioning (lucky it was kind of a chilly evening), a hole in the wall place, I don't blame him, I have second thoughts when I walked into Djerba la Douce too!   But when I tried the food! The tasty well prepared food...full of flavours...cooked with care and love... I knew I made the right choice..   Calamari Djerbieno $6.95 (tender calamari and the sauce!!!)  Brique $4.25 (lemon,herbs and incredibly light!)  Chicken Merguese Couscous $13.95 (Couscous is the star!!)  Trout with Coriander Sauce $15.95 (spicy and creamy and peppery!)   They all tasted so good... has great balance of spices and herbs, foreign yet familiar.....   Since every dishes are cook when order and having a small kitchen with 1 cook, it takes time... But it really worth the wait!   If you want ambiance, go across the street to Walima.... we can meet up later and listen to you complaining about their lousy food!"}
{"business_id": "47wBHgBwQ8_70sjmXow_1g", "stars": 5.0, "text": "I think I am always thirsty and love to get my intake of calories in liquid form? Her Father's Cider probably the only Cider bar in GTA. And I was impressed with their selections!  Love the $12 Flight Options of any 3 ciders on taps.   West Avenue Gold 2015 6.9% Shiny Pinot Noir 9% KW Thai Ginger 6.7%  All so tasty and easy drinking and refreshing!  They were so good that I ended up drinking them so fast and the next thing I was like a little drunk?!   Lovely vibe, Friendly staff and even have a west facing patio if you want a lot of sun.  Cannot comment on the food but awesome cider selections. Worth checking out if you love ciders!"}
{"business_id": "9v9cMGBpUm_IzTuPfXXEOw", "stars": 1.0, "text": "Firefly Seafood and Steakhouse is another Chinese-HK style restaurant at First Markham Place.  Yes price is really good... but if you come here for some good cut steak you will be disappointed!   I cannot really expect what you get from a $9.99 set dinner!  They accepts Visa and Mastercard."}
{"business_id": "R-EGIdIgtoFzl--OudANtA", "stars": 1.0, "text": "There is nothing I really enjoyed during my only and the last visit to Yummy Cantonese Restaurant.  Yummy Cantonese has a Chinese name that indicate that it is specialized in Rice Noodle Roll. I love rice roll, but this is one of the worst rice noodle roll I ever had in my own life.  The restaurant is kind of dirty. Though it is new but it is not really new as it took over Man Cheong http://www.yelp.ca/biz/man-cheong-congee-noodle-scarborough without much cleaning up! I swear that they never even clean their condiment bottles as they are all sticky and yucky!!  We shared   Plain ($2.25) & Minced Beef ($3.25) Rice Noodle Roll looked ugly and tasted worse. Usually rice roll has this smooth and silky texture, here they looks like a wrinkle face of an old person.... and tasted bland...  Fish Sliced and Beef Congee ($4.50) was a good portion for sharing. This tasted more like something I would have made at home. The congee based are not dense or smooth enough and nothing else was added to the preparation of the base to give it a smooth consistency.  Yummy Cantonese is NOT yummy at all. Won't be coming back!"}
{"business_id": "bg3YcuqVyQofTz5d4kKgug", "stars": 1.0, "text": "Federick, you really disappointed me!!   When your kitchen's cooking is worse than mine, I really have an issue!!  The Corn with Crab soup is so starchy that basically my spoon can just stuck there upright! The Crab though not fake crab are the previously frozen/canned varieties and is so fishy! I definitely can make my soup from the canned corn from the supermarket and makes it so much better! The whole table even have a hard time even finishing their small bowl.  The Chilli Chicken has no chilli, no spicy, no fire... It is not even wok hot! The reason I am eating out in an restaurant because I want the dish to be fresh and serve hot directly from the wok.... It taste like something I get from T&T hot food department...  The Fish Pakora hardly have any favour... but at least it is the best out of the 3...  The indifference waiterstaffs with no smile I can get over since this is normal for Chinese restaurant.. but medicore food.. I really cannot stand!  I hope my experience is just an off night from the kitchen.. it is so sad when this happen... Will I be back?  Sorry, maybe not!"}
{"business_id": "yENVQfQhSljHGz-BbHHKQg", "stars": 1.0, "text": "I don't understand why so many people like shopping here!!  OK, the price maybe cheapest but the crowds, the smell and this place is filthy!  When Uni Mart was here , I used to go to buy prepared food and now I refused to buy anything here! The ingredients they use is not even worth what you paying for..   In the summer, they left all the fruits in front of the stores underneath the sun.. there are tons of fruit flies on them...  I rather pay a little more and go to T&T at least the place is cleaner.  They accept CASH and Interac only."}
{"business_id": "Uu7aqb4jTW2xWGMLpVR-yQ", "stars": 1.0, "text": "Sugarbuds Village Bakery & Cafe seems to be really popular with the local people but I am not really impress...with both the service and the quality of their sweets..   My friend got really confused when she walked in.. seems like this place is divided into a cafe that serves some cookies and pastries and drip coffee in the front.. then the other area has a hot station and more sweet and baked goods at the back.   There is no prices and signage on some of their baked cakes... so we tried to find out what they are.. but even the servers are little confused about what they are and how much they cost. Same with their Macaroons, she not even sure which flavours they are... we have to tell her that that brownish one is cafe... pistachio is the green one.... hmmmm   The display of cakes and sweets are so not interesting and tempting.. even mine will eat anything that is sweet were not excited. Sugarbuds have serious problem here!  Blueberry cake ($2.75)  - the cake based is really dried.. and doughy and chewy..  - tastes like a something I get from the supermarket.. (hmmm and they call those gourmet cake slice?)   Macaroons ($1.25)  - one of the cheapest one I ever got... I wonder if they make it in house... I really doubt that..  - not too fresh! it tasted stale already the next day...  There are hardly any sitting in the cafe area..and they are selling Timothy's brewed coffee... feels like more of a coffee shop style instead of a cafe...   I don't think I will be back again.. I would rather have a cappuccino and tiramisu at Fratelli Village next door!"}
{"business_id": "tuUX96eC3SBnNKNO7l6rew", "stars": 1.0, "text": "What was that??!  Why did you use a marker to write my order on my mug at exactly where I am going to sip my coffee from?? I don't really want to eat or taste marker ink with my coffee.  Americano was not bad. worth at least a 2 star.  I know as a business you might not be fully responsible for your customers hoarding the tables and chairs and think they are in a library. 2 people took up 2 tables for 4 so they could put their jackets and personal items? I know it is close to Ryerson and this is a coffee shop where people drink coffee and socialize, not a study room.  Maybe Zavida you can start putting some hooks so your customers can hang up their jackets instead of taking up chairs that paying customers can sit down and have their coffee."}
{"business_id": "UVKi839mvCc9BrCmeJbitA", "stars": 5.0, "text": "What better to write about Food that I love the most for my 600th Yelp review. (BTW, this is also my 1st anniversary review since I wrote my first ever Yelp review on November 11, 2009 when all these Yelp Madness started!)  Yes I love Japanese food, especially something that is authentic. Not traditional but authentic in the spirit of the art of Japanese cooking!   In the sense that the chefs spends a lot of time and effort to:  - try to buy the freshest and the most seasonal ingredients  - perfect the process of food preparation  - paying attention to details  - make the presentation a work of art  - understand serving the end product with people that appreciated is their goal   Shinobu Sushi is really the ONE! Love the small, intimate set up. The chef is the one that prepare every single order which ensure that everything that Shinobu serves are up to his standard.   I have to say the sushi rice is the best I have in Toronto. That alone blow my mind away. Now I don't really want to eat those crappy rolls/sushi in other places... don't tell me that it is the same as AYCE.   The Volcano Rainbow Roll ($8.90) is so awesome. I know using the blow torch is something more westernized but it does give the roll a really complex taste...   The quality and the cut of the Sashimi is amazing... and with the fresh wasabi..(thanks GOD no tube thing!) oh so melt in your mouth orgasmic experience! (gee I don't believe I wrote that!)   The price is reasonable so compatible to other Korean/Chinese Sushi place I have been too. Extra +1 stars! I hate pretentious places that charging people stupid prices for their food!  Shinobu Sushi is one of the few Japanese restaurants which I will say I AM IN! when someone ask me to go for dinner!   *Thanks my Food Crawl Buddy  for including this little gem in our mega Food Crawl!"}
{"business_id": "WWH9yYIPK4aXZQ6J1nKYBw", "stars": 1.0, "text": "Yuan Yuan Chinese Restaurant is a Northern Chinese restaurant.   Deco here is minimum. Almost all the waitress and patrons here are Mandarin Speaking... I have to say it must be quite authentic!   Lunch Special at Yuan Yuan seems like a good deal at $5.50 includes taxes and the portions are huge! But it is the Worst tasting Beef Noodles I ever ate!   - Soup is warm... and taste bland... like colour brownish water  - Noodle are not cooked properly.. oh so flour tasting and chewy and bland... just hate it! And so plentiful too.  - Beef tasted so dry and tough. And not much of a taste and they are like cold.. just hate it! And so plentiful too!  - Veggie is the only thing I like in the beef noodle! And hardly have any!   I just could not finish even quarter of that! Just feel like throwing up when eating it... hey this is REAL bad!   BTW, the waitress here was not too nice, frown on me when I ask for the Lunch menu...   The other dishes might taste better, just don't order any noodle soup! But I don't know if I going to be back to check those out!  Cash Only!"}
{"business_id": "3ohJ9WQLb5Cbb_j1zdJ-xg", "stars": 5.0, "text": "I changed my mind about Fabarnak!!  After my last visit to Fabarnak with 2 yelpers and ended up I have a chance to order some real entrees..... (Nice Yelpers were forced to shared theirs with me!)  Sorry, Square Box I no longer love you as much as before.....  Entrees, you are my TRUE LOVE. You are so well prepared and with class and great flavours. You are the REAL DEAL....and a real deal at that price too!!  Now I have to come back to try the Fabarnak's Brunch Menu (the morning after meal)!"}
{"business_id": "WvZNFpqlxizKaL6K4IZ5tg", "stars": 5.0, "text": "Chocolate Heaven! ChocoSol Traders' Eating Chocolate is just amazing. Dark Chocolate is just my favourite  Rustico line has varieties of bars which are 65% to 100% cacao and the bars are stone-ground for approximately 8 hours.   Five Chili Bullet (75% cacao) - spicy and you actually can taste the individual chili flakes Vanilla Sea Salt (65% cacao) Mon Cherry D'Amour (65% cacao) - There are chucks of dried cherry inside  Jaguar Chocolate (82% cacao) is one of their unique offerings made from a very rare albino cacao bean known as Theobromae Bicoloris. According to their website, they are the only chocolate producer in the World that make this type of chocolate.  Chocosol Traders were founded in 2004 in Oaxaca, Mexico but have been based in Toronto since 2006.   Thanks so much in bring such amazing Mexican chocolate to Toronto! Cacao is really the Food of God"}
{"business_id": "PUneCUDGvdgnay3uvI89fA", "stars": 1.0, "text": "Luckily I am not here with a date, I think I would never answer his phone/text/email nor going back to Sushi Bong ever again.  I am all for value! But I am not on a feeding frenzy to stuff myself with cheap food just to be full. If that's your goal, maybe Sushi Bong is for you.   Dynamite Roll is huge since it is stuffed with rice and rolled up in chucks of tenkasu. Great for photos and that's it. The taste is just blah, with no substances.  Sushi Bong Special Combo is just so poorly presented. No effort to make it into something that what Japanese cuisine suppose to..   No effort to have their shari rice probably prepared... But the order is huge for the price.. good if you are hungry.  Please bring cash or your bank card... if not your date might have to even pay for your meal...   Parking is free at the visitor parking underneath the building, if not there are plenty of meters around if you don't mind paying for parking.  Sushi Bong is not even up to par with some of the AYCE restaurants I been to. I just suggest to give it a pass, since there are a lot of other options in the area!"}
{"business_id": "kA2EMJl7F0UrSP4xqFtEhw", "stars": 5.0, "text": "I have been thinking about that Country Fried Steak since last Sunday. This is probably the only place I know of in GTA that has this on their menu.  Fried Chicken Steak was crispy and crunchy outside and with tender meat inside. Now I am a believer!   And for $12 with a Side!   Though the set up was casual. Service was excellent. Staff delivered our drinks and food to our tables and checked on us to see how we enjoyed our meal.  Local Crafted Beers on taps and in bottles. What more can I asked for?!"}
{"business_id": "3ohJ9WQLb5Cbb_j1zdJ-xg", "stars": 5.0, "text": "I finally made it to Fabarnak for a late late late lunch... 3:30 pm??   Heard so much about it and I need to try it as one of those curious I want to try everything and be everywhere yelpers.. and I was not disappointed!  Me running into the restaurant with my pink umbrella with hungry in my eyes: You still have the Square box lunch? Can I have one? Nice Waiter: Do you know what's in it? Me: No, just give it to me! I am hungry and I will eat anything!  Nice Waiter: But I need to tell you what's in it before I can serve that to you..  I just love the idea of having different lunch specials everyday and everything are locally sourced and  thoughtfully prepared and all so delicious!  Services was excellent as my Nice Waiter came over my table and poured me my water/soda and making sure I am happy.   Unfortunately, my ice cream dessert was melting even before I finish my salad... Maybe they should have served frozen dessert separately??  After eating my Square pegs box I do feel pretty good about myself... I ate healthy, I did not even Asian food for a change and I know part of the lunch money ($9) I spent on this meal would be doing something good...  Yes I will be back!! I going to take the subway and brave the weather to come and eat at Fabarnak again!!"}
{"business_id": "0EnXIr4UQTemA0R2hlyR8g", "stars": 5.0, "text": "I didn't come to Kem CoBa for gelato, ice cream or sorbet because it was freezing outside.. but  Trust me their chocolate is so good!  Right when I walked in Ngoc offered me those chocolate to try... Matcha is just so good... have this sesame crunch and yes I was sold there and brought a bar for myself! The white chocolate coconut has really delicate flavour without being too sweet!  And all those cartoon like chocolate as they are having a Safari theme... so adorable!   My friend have to drag me out of the store before I started loading up of all these sweet.  I did come back again the next day for more samples... :) and said hi to the owners...  Maybe I have to plan my route to stop by everyday next time when I am in town!"}
{"business_id": "zbFtY82_ummK4amkT-M04Q", "stars": 1.0, "text": "This is the sister restaurant of Top 1 in Richmond Hill. I have to give them credit in how they renovated the previous restaurant into something that is clean and upscale.   But is that alone enough to bring in business? How about 10% off? Not really, as I doubt I would be back.  Soup was a not a good start as the menu described as traditional soup of the day but we got a funky snow pea sprout with corn starchy soup.  The main were not bad as the beef tenderloin though over sauced but tender but with no honey black pepper flavour. Lobster and fried rice were ok but be careful of sand inside the veggie.  Dessert was one of the worst red bean soup I ever had.  A watery soupy mess.  Service though is friendly but even the waitress realizes how bad was the dessert, I think there is an issue.  Will be a pass.. $48 for a set dinner for 2? There are way better options in Scarborough than here."}
{"business_id": "SGP1jf6k7spXkgwBlhiUVw", "stars": 5.0, "text": "I can really try every single flavour at Kekou Gelato House?!  The friendly lady did let me sample almost half of what they offers and the more I tried, the more I could not make up my mind!!  But here I sampled one of the best Black Sesame flavour I ever tried! So intense and love those bits of real sesame inside...   Durian Gelato has such good flavours! It is just like I am eating the real fruit with no filler at all.... I can eat the whole tub by myself.  I can eat those 2 flavours everyday and I would be a happy content person.  But seriously, Coconut Sticky Rice? Spicy Mango? Coconut? Vietnamese Coffee? Ube?  I am in LOVE!"}
{"business_id": "BHX0ghpo_r4lVxGRPEBIQw", "stars": 1.0, "text": "Dumpling King is called the Dumpling King for a reason... I should have know!! Why did I order something else but the dumplings??  I was here for lunch around 12pm and this place seems to tailored to big tables.. because all the big tables were filled! There were basically 40 patrons and with 1 waitress serving us all! Now you know I would not get getting any services.. and I will be waiting a long long time for my food to arrive.  The waitress is really cheerful however she is really overwhelmed from being all by herself.   I order the Cold Noodle in Sweet and Soup Soup and the Braise Beef Pancake.   Waiting Waiting Waiting..  The Beef Pancake I found is just ok.. The wrappings is too thick and with hardly any beef or green onion. (I am comparing to the one that served at Asian Legends).  Waiting Waiting Waiting.. did they forget my order?  The Cold Noodle... hmmm bad! Some of the Noodles are still hard.. not fully cooked! The soup base is really bland. I prefer the one at Dumpling Village a lot more! Just please don't order it!  Why the charge on the real bill is more than what they said on the menu??   Cold Noodle Soup Menu $5.99 VS Actual $6.99 Brasie Beef Menu $4.49 VS Actual $5.29  Maybe they really need to update their menu and the information on their website? Or I just being a sucker??  No Lunch Specials!  Cash Only!"}
{"business_id": "Cq0sYOi5c0SIj0R7XZeYeQ", "stars": 5.0, "text": "Thanks all yelpers! Thanks for reading my 700th review!  If it is not for Yelp and fellow Yelpers, I would not have come to Noisette Pastry Works.   Noisette Pastry Works is such a nice, cute and homey cafe located in one of this small strip mall... no one really notice it! At least I did not and I been driving by that intersections so so many time...  This place is really a dream come true for people with sweet teeth! Those sugar sprinkled cookies so nicely decorated are just way to pretty to be eaten but to be admired!   Black Forest Cylinder Cake ($4.25) is A-OK.. because I love the chocolate wraps.... cherry... not really......  Macaroons($1.75) have 7 different flavours and priced so reasonably... they are yummy good.. (I am not sharing!)  They also serves homemade soup for lunch today special are Pumpkin Ginger Soup and Chicken Noodle Soup! There are panini, sauage rolls and others if you want to have a quick bite before having your desserts!  The reason that I gave this place a 5 stars is really the owner/servers/bakers/cooks that works that. They are the most lovely people I met... They are so proud of their cafe, their products and they find joy just  serving the customers and see their smile on their faces!   So if you are in the area, drop by to have a coffee and some lunches, say hello to the ladies and you can even park yourself with your laptop using their free WIFI!"}
{"business_id": "EfCokOBABzEFRlnvKr6-tw", "stars": 1.0, "text": "They are CLOSED!!  Replaced by another Ramen Restaurant!  Jyuban Ramen House  http://www.yelp.ca/biz/jyuban-ramen-house-thornhill#hrid:0dPL60AQ6UzoDBUgba6PxA/src:self"}
{"business_id": "EsVbvJ4cWsB_UX8iDqVS4Q", "stars": 5.0, "text": "I do Trust The Barista ($12), especially the one at Pilot Coffee Roasters.  The Opening hour here is a little awkward. If you are working some regular office hour (9-5 M-F), you might never able to come to experience the Tasting Bar unless it is your day off. But I tell you, it is well worth it if you are an avid coffee lover.  Of course you can also just order what you like off the menu. Pour over, Chemex, Espresso, Cold Brew. Talk to the nice barista if you are not sure what to order. But if you have time, I definitely recommend the tasting menu.  3 different roasts with 3 different brewing methods.  BTW, I have always been a Tre Aro and Crafted fans so I really enjoyed my experience here.  Maybe one day I can do some coffee cupping here.   The aroma of roast coffee beans on site is just so intoxicating."}
{"business_id": "TvX_DivZScuFUqUigzgBFg", "stars": 1.0, "text": "Someone suggest  that we go to Vanipha Lanna Lao-Thai Restaurant for some authentic Lao Cuisine!  I tried calling for a reservation and the lady inform me that they no longer run the restaruant only providing catering services! :("}
{"business_id": "YwDZUnYeWyNFgBelSdE-Fw", "stars": 5.0, "text": "I am bias.   I have this thing for local business that is friendly, innovative, enthuiastic and love what they are doing.  And Hatch is one of them. They do Coffee well. Single Original Beans roasted on site and Cold Brew. The roast is lighter but I do like their Scandinavian concept from packaging to produces.  Great for french press and pour over. Especially if you are into lighter roast with a citrus or floral note.  Drop in for tasting is welcoming. You can meet the roaster and do some coffee geek talk.  All their coffee and cold brew are available for order online or at the roastery. And you can also enjoy them at Millie Crepe in Marhkam."}
{"business_id": "vX279Yu9Ag2dPhybrq40_A", "stars": 5.0, "text": "Fair Grounds Organic Cafe & Roastery might just be a dream come true for a coffee nerd.   Down to earth with zero pretence. Here at this cafe you won't find fancy deco, people here with their laptops, nor super comfy seating. People here just have one thing in mind.. amazing coffee!!  Just like someone garage.. oh yes this is a garage?! With minimum deco but the best decoration is the coffee roaster. Here on their beans are roasted on site from organic fair trade coffee.  How's the coffee here?! Both the espresso and americano we ordered has great crema, full bodied and a delicate fruity taste..... Love...  Opens 7 am - 2 pm daily. A little out of the way.. but definitely worth my while to come back here for that special cup of coffee.  For real coffee nerd, please talk to the barista who is also the one that roasting all these beans."}
{"business_id": "RUd_M7DPJq1I3DPq0oF--w", "stars": 5.0, "text": "I really feel the LOVE when I was eating at Lahore Tikka House!!   I was fully prepared for a crappy under construction/renovation place before my arrival from reading the reviewers and from my fellow dining mates. But I find that the imperfection of the deco gave it a certain charm.   We were seated in the Patio, just love this open and communal style seating! It gave me a feel of attending a wedding with all the music and noises, a feel of eating in an Asian countryside somewhere (yes it did get hot with the crowd and all the spicy and smoke from the food).   Garlic Naan ($1.95)  - was so good... yes a full carb attack.. fresh and soft and oily!!   Butter Chicken ($10.95)  - deliciously oily, the sauce taste so good with the Naan bread.. the chicken itself is so so  Aloo Gobi ($7.25) and Chana Masala ($7.25)  - hot and spicy and oily cauliflower and potato/chick pea! Guilty delicious and even my non veggie eating friend could not stop complimenting how good his veggie is!!   Lahori Beef Kabab ($1.99 each)  - soft and nicely spiced...and the sizzling hot plate makes the oil splashing everywhere.... hmmmm   Kashmiri Chai ($2.49)  - Pakistani tea tasted so good.. especially I am a fan of nuts... I drank that like a dessert! My first experience with pink tea.. now I am in love!   Lahori Kuifi ($2.50)  - creamy, custardy ice popsicle that never melt?? It is so devilish creamy ... just don't think about the fat content and enjoy!!   The services here is awesome for a hole in the wall, under construction restaurant!! I have more attention than in one of those high priced snobby restaurants.   PS the waiter was walking around with a long skewers of green chili peppers!! Just wave him down and he gave me all the chili I want!! :)   I can't wait to come back here again with my dear friends!!  Talking about smell and smoke eating here! My phone smells like Butter Chicken....I can smell it even I tried wipping it down...."}
{"business_id": "ygJshif4VuxL1ijnRJnuYA", "stars": 1.0, "text": "I remembered the days when I came down to Lee Garden Restaurant to eat at least once a month.  I no longer visit here anymore and I don't remember why..  But last night visit did bring back memories.....   The interior and decoration is just like it used to be. The one thing I am glad is the ladies room is clean and even smell good!   Service here is excellent and fast! Maybe just a little too fast as I know some dishes should have taken longer to prepare and cook.  We ordered:  Szechuan Chicken ($16) - bland tasting chicken breaded and deep fried - sauce is more sweet than spicy - the crispy chicken is really soggy too  Smoked Chicken aka Grandfather Chicken half ($15) - The most disappointed dish of the night, since this used to be my favourite dish - Chicken suppose to be moist and tender with this smokey flavour from tea leaves, the honey sesame flavour from the glazing but what we served was a chicken that tasted bland, dried and the half of the skin was not even there  Sticky Rice with Chinese Sausages ($11) - Usually sticky rice suppose to made to order so there is still the fresh from the wok taste, but this rice was arrived on our table lacking everything   Zucchini with Garlic Olive ($8) - Not a bad dish but the garlic olive flavour definitely missing   Honey Orange Ribs ($18) - I really not into honey orange sauce and this definitely not my go to dish usually  Both the complimentary soup and red bean dessert were overloaded with orange peel... taste was off... balance was off  I can definitely have much better meal at this price point at a lot of higher end restaurants uptown which offers much better prepared food.  Sorry Lee Garden, I don't think I will ever come back, even for Old Time Sake!"}
{"business_id": "_bKlU11Ehew_wAntByYGRA", "stars": 5.0, "text": "4 Star + 1 Star for the Daily Special  Chip+Malt maybe the best Fish and Chip joint in GTA! It is worth the drive to Newmarket!  The decor is nice and playful.  The seating is comfy. The service is super friendly.  Where else can I get a Haddock with Chips for $10.99?!   The fish is fresh. The batter is light and crispy. The fries is crispy golden.  Sticky Toffee Pudding ($6.99) with Guinness Ice Cream ($1) - Rich and heavenly. More a brownie texture.    Sadly Yorkshire Pudding not ready for lunch. I have to come back during dinner.  Chip+Malt is a 5 Star experience for me!"}
{"business_id": "bejxx0XrZ6Ogv-o-3InELA", "stars": 1.0, "text": "0.5 Star for free parking at the back lot 0.5 Star for the free wifi and the waitress did give me the password 0.5 Star for the free water and the menu  But we were left sitting there reading the menu, drinking our water, playing with my phone for over 10 minutes... I felt invisible, I felt helpless, I felt no one even see me when I tried to get the wait staff's attention?!   So we drank our water and use the washroom... and walked out without even able to order and taste the food that Sugar Marmalade offers.   We walked out and even no one noticed? Maybe I am really invisible..."}
{"business_id": "tMzxYl_H6yigMNZPp2yuKg", "stars": 5.0, "text": "Me Walking down Avenue Road heading towards Starsbuck .. No idea what Seven Grams is... Looks like one of those chic expensive designer furniture store when I looked through the window.. Then I saw ESPRESSO... I ran in so fast!! Bye Bye Starsbuck!  Such an amazing space!! I was sold on those orange space ship style chairs... how cool they look!!   If you want more actions, you can hang out in the area right in front of the espresso bar... watching the barista at work and people watching always fun!!   If you want some peace and quiet, there is also a lower level... benches with cushions.... tons of cushions......   I was lucky to find an outlet so I able to charge up my ipod and check in using their Free Wifi..   Cappuccino ($3.59) was quite good with great latte art. Seven Grams is one of those places that has this strong roast and I secretly wish there is more milk froth in my drink.   Seven Grams now being my official hangout place when I am in the area! It is that awesome!!"}
{"business_id": "r_BrIgzYcwo1NAuG9dLbpg", "stars": 5.0, "text": "Stepping inside Pai Northern Thai Kitchen transfers me back to Northern Thailand where the food is spicy and flavoured, people is friendly and nice, and the weather is hot and hotter....  Pai Northern Thai Kitchen is a heavenly place for me.  We were luckily to arrive at around 11:30 when it opened on a weekday and right before the lunch crowd came in. Make a reservation if you have a big group, you won't regret that. For singles, there is always the bar area if you just want a quick meal.  Lunch menu is limited but includes most of my favourite items. My NYC guest wanted to try everything........ and of course being a wonderful host, I let her go crazy a little.  We ended up sharing:  Papaya Salad with Dried Shrimp ($10) Chef Nuit's Pad Thai with Chicken ($12) Pad Gra Prow with Egg ($12) Mango Pandan Sticky Rice ($8)  Thai Iced Tea ($4.50) for my guest  I should not had used the word sharing as my guest just have a few mouthful of appetizer and mains and declared them too spicy for her. I was kind of happy to stuck with finishing everything! Aside from the dessert!  Dinner menu has some interesting item which I would love to try. I guess I would be coming back. Again and Again."}
{"business_id": "BGiZM3rc5Sj3pJZQ-7mkgg", "stars": 1.0, "text": "Ka Lung Court Chinese Cuisine went out of Business! If you want Dim Sum, you need to go somewhere else!"}
{"business_id": "cc-u2OVJOMYQQKJEaAkcpQ", "stars": 1.0, "text": "Closed for Business replaced by Senwell Vegetarian Cuisine http://www.yelp.ca/biz/senwell-vegetarian-cuisine-markham#hrid:T1qBy7w7BDUl1VXjvWHa2Q/src:self"}
{"business_id": "oMuQVUYemxZQP8AllRLAqw", "stars": 1.0, "text": "Used to be good... But they changed owners and even their names are changed.  None of the dishes we ordered are up to par... the usual Kenny's Noodle's qualities.  I would not go back there!"}
{"business_id": "bnhwQZPmTghs8fynQtQiVQ", "stars": 1.0, "text": "Talking about going downhill... Kim Po Vietnamese Restaurant is doing a free fall...  I think I need to have a drink or 2 or 3 at the pub next door.. before I ever come in here to eat again... or maybe I should just starve??!!  All Day Specials seems to be great value with a free drink coffee/tea..  Curry Beef Brisket with Rice ($7.50) /milk tea - Rice still hard and cold...  - Curry lurk warm - Milk Tea is day old just add water and microwave..with no taste at all! - Maybe they just microwave everything a couple of minute more  Special Pho Large ($7.95) - Sizable.. too sizable especially when the broth is bland...  With just 2 tables to serve, our waitress was loud and gossipy... I don't want to listen to your life story..... I just want some peace and quiet while I eat my food!  Maybe I should just spend my money on drinks......."}
{"business_id": "L-Yj3Y1bYKTSg4uE9KTVBw", "stars": 5.0, "text": "Best BBQ in GTA??   Adamson Barbecue maybe just the special one and my search is over! Just be warned that the line is crazy on Saturdays! BBQ's lovers lined up even before the store is open. I suggest visiting on a weekday early, usually there is no lines. It opens until they sold out and this is usually before 2 pm.  I would suggest ordering just the meat by the pounds instead of as a meal combo. The sides are not amazing, I would just want to eat more MEAT! Love the dry rub on the ribs! So tender and the meat just fell off the bone. The beef brisket too was smokey and tender.  If you want to skip the crazy line, especially for Saturday, pre order a $100 platter for pick up 4 days in advance. You can order a combination of meat option and there is a special pick up line for that.  No more lining up at Rib Fests as I can now get some great meat all through the year!"}
{"business_id": "6tfr3R75PhtFTisRds0iHQ", "stars": 5.0, "text": "I heard about Nguyen Huong Vietnamese Sandwiches for years...   Before they used to be just in Chinatown..or you can get their sandwiches in some supermarket(which tasted not good at all and get can stale by the time you eat them)  This is right next to T & T at Middlefield. When I walked in this store I am in heaven!! Basically I like to eat everything here! Yes everything..   - freshly made sandwiches!! I prefer order my sandwiches fresh (you can choose chicken, sauage, bbq pork, veg, meatballs or the classic cold cut) and I can custom order what I prefer! usually NO pate and extra pepper.. (extra extra pepper) - fresh spring rolls I like to order their spring rolls to go with my sandwich... you can pick meat or veggie - Desserts They have a good selections of dessert pastry right at the cashiers..ok why put it there.. so I can see them and buy them! And they have the sweet soups desserts.. for $1.50! and so many to choose from... all my co workers love them! - Vietnamese cold cuts Anything you can think of or some that you don't.. - Prepackaged food Cold meat or sauage with noodles and fish sauce, steamed rice noodle rolls with meat  And everything priced so good!!   You have to go to see it yourself!!   Thanks Nguyen Huong for openning up in the suburbs for us!!!  CASH only!"}
{"business_id": "mljVLg3inB8h2L6wKC-szQ", "stars": 1.0, "text": "An advice for Pho on 7... Having a Groupon deal won't boost your business if you handle the coupon and your customers the way you did!!  Since my voucher is for dinner for 2 and includes a lot of food.. I know I would not utilize the value. but my waitress insist that no matter how much food I order, I would need to pay taxes and tips on the Full amount.. but why am I paying taxes on something I didn't even order?  I lost my temper/cool and finally one of the waitress had everything sorted out.. and I back to ordering...  We ordered   Mango Shrimp Salad ($7.97) - cold frozen cocktail shrimp? for $8?!! Mango Salad ($6.97) Vietnamese Rice Paper Roll ($4.27) Satay Chicken skewers ($5.97) Vietnamese Bean Curb ($5.27) Large Pho ($7.97) Vermicelli Combo ($7.97) All tasted below average... Chinese version of Vietnamese food and a bad version...  Since we have some leftover credit on our Groupon, I was hoping to get some dessert.. They do have an interesting dessert menu but the waitress said they never have any of those ever, since no one ever really order them.... FAIL!  I won't be surprise to see Pho on 7 would be out of business soon if they don't improve on their quality of their food... and having Group Buy deals not going to help!!"}
{"business_id": "A0uioTVbL-QszRL8qCwbTQ", "stars": 1.0, "text": "I don't have high expectation for McDonald's. All I know is I suppose to get acceptable fast food and fast service..........  Walked in wanting to get a treat after having lunch next door and the place was crazily busy. The reason was not because this McDonald's is the coolest place to be, the staff here were just so disorganized and slow...  Our Strawberry Sundae, Soft Serve Cone and Iced Coffee took forever to be ready! Not like those are custom orders or need to be cook!!  Lines just kept getting longer and longer........ I just want my ice cream!!  Sadly my ice cream was meh as the cone tasted stale............ FAIL!!  The only good about this location is the dinner area opens 24 hours! Maybe I will be back  if I am drunk, hungry and desperate........"}
{"business_id": "EJmiKQKlWfY-0iVlya7FOQ", "stars": 1.0, "text": "Z-teca really falling short even with my limited Burrito experience.  Ok I have Chino Locos... their Burritos are freaking awesome!! Something I dream about and I am down doomed... rating everything against theirs!  Z-teca burritos I just cannot stand it! The grilled chicken I have hardly have any chicken inside. The wrapping is just so doughy and it is just stuffed with tons of blend tasting of rice and veggie...  Even drowning it with hot sauce did not improve the taste at all! I love Todasco, if heavy dose of Todasco cannot revive this burritos...nothing will!!  The interior I find it a little cold.. with all the metals deco and the wooden chairs just downright uncomfortable!  No I will not be eating another Z-teca burrito even someone is buying! :)"}
{"business_id": "4kkh8Uj0jG7olKEocCASrQ", "stars": 1.0, "text": "I would never have go into Barcode Chinese Restaurant if I am alone!!! No way... even I am really desperate for a FTR, but I do have my standard...   While driving to the restaurant... I passed by undeveloped commercial factory area... sketchy... and then my GPS led me to this garage look alike address...... maybe this place used to be a garage??   We were greeted by 2 good looking Chinese girls... I guess because of that he didn't ask to leave...and we were seated at a booth of this completely empty restaurant... BTW, not even any other customers came the whole time we were there...... private dining experience!   The best thing Barcode has is the WIFI.... and sweet looking waitresses. The restaurant feels like someone's basement... there is a pool table, some messy here and there... and cheap recycled furnitures.   Menu is nicely done with tons of photos, so it is easy to order... and they spell there OWN name wrong on the cover of their menu...   - Spicy Crab ($8.99) and Spicy Winkles ($9.99) both tasted A-OK and plentiful. We can barely finished them.   - BBQ Back Ribs ($8.99) was really disappointing, dried and bland...   - BBQ Lamb Skewers ($4.99) came in 5 skewers.. nicely marinated with cumin, chili powder, a little dry..but taste ok if you ate them when they were hot   - Tanghulu ($3.00) (candied Chinese hawthorn) was totally disappointing!! It was like frozen hard..and you might harm yourself or chip a teeth if you tried eating that!   I been to more shady and dirty joint before and Barcode is not the worse... However, it really ticked me off were those waitresses was skewering raw chicken/beef on bamboo sticks right next to our table and serving us the same time.......There must be some health code against that?? Do it at the back!! At least I don't know......   My friend got his good looking waitresses..but I got nothing... at least I don't have tummy ache after the dinner... ... I don't think I will be back!!"}
{"business_id": "cEIrFjyk_-TC70kr3J7lEg", "stars": 1.0, "text": "Best Choice Restaurant is one of those place that if you want to stuff yourself without paying a lot of money.   I can tell you they do have their loyal followers when the restaurant is nearly full on a chilly cold weeknight after 9:30 PM.   I ordered a Dumpling Noodle Soup. The portion is big... with tons of vegetables and 5 big fat shrimp dumplings. However, it was loaded with MSG! After I finished eating that my tongue was numbed for the whole night.   I would not recommended Best Choice if you are really sensitive to MSG.   The services were quick and friendly.   CASH only!"}
{"business_id": "7RY6ARllxXFXYTTXtP-8Eg", "stars": 5.0, "text": "I have to take it back!! Some of the items on the menu of Little Bangkok are Thai Spicy without special request!!  And if you like Thai spicy like me.. you have to order Dry Beef Curry - Panang-Nuer. OMG!! It is so hot and spicy! One taste my dinner mate could not even handle that! I was in heaven though.. I ate the whole order with my rice all by myself!! :) The curry has so much taste, so much flavour! The beef is nice and tender... hmmmmm  BTW, I requested fresh chilli for my Papaya salad on the side and my request was fullfilled with nice fresh chopped chilli plus hot sauce. The salad tasted so good.. but the portion is really small... I wish for More More More!  The other dish I ordered is Basil Spicy Seafood Noodle - Pad-Kee-Mao-Talay. Still too spicy for my dinner mate! I told the waiter about that and he even want to take that dish back and replace it! That's not really the kitchen's fault as the dish suppose to be spicy?? I order another pad thai and everything is A ok again!"}
{"business_id": "XROJOdu4YWGZR5kQO1C04w", "stars": 1.0, "text": "The Chef Thai Fusion are closed!  Replaced by Sushi Tei!"}
{"business_id": "rjJM4xHdCKJRUpovQ-msAQ", "stars": 5.0, "text": "Back here Mi-Ne Japanese for dinner and really enjoyed my  Chirashi ($17.95) has such good selections of fish: BC Tuna, Tuna, Salmon, Salmon Roe, Tobiko....  All nicely presented and artfully waiting for me to enjoy!  One of the best Chirashi in the area at this price point!!   Now I know where to fulfill my sashimi craving! Mi-Ne is the one!"}
{"business_id": "oJw00wAOWkjfwJEf8LBONQ", "stars": 1.0, "text": "I just have the worse ever drink I ever had in my life, thanks to Honey Tea H.K..... Maybe I had worse, but it was bad enough for me to dump it after a few sips.  Yuan Yang (Hong Kong Style Milk Tea and Coffee Mix)$1.25  - not enough milk - coffee and tea were stale - bitterness that would not be sweetened doesn't matter how much sugar I add  Maybe because the staffs of Honey Tea H.K. were having their lunch break when I was there picking up my drink... but that is not really acceptable!"}
{"business_id": "rjJM4xHdCKJRUpovQ-msAQ", "stars": 5.0, "text": "This review is based on my lunch experience at MI-NE Japanese Restaurant. I would say it is the best Sushi in the Richmond Hill area at this price point!   Sushi Combo L1 ($10.95)  - comes with standard miso soup and salad  - 7 pieces of Nigri Sushi (shrimp, and 5 pieces of Maki  - Fish is so fresh! The shari rice is nicely cooked fluffy and have great bite  - good portionally balanced between fish and the amount of rice  - Maki nicely rolled... fat and big... and with black sesame on the California roll   The meal ended with a half sliced orange... healthy dessert for a great sushi lunch!   There are 3 sushi chefs working at the sushi bar. They were all well dressed with their white shirts and ties underneath their sushi uniform! You can see how much they respect their work!!   Waitstaffs here are nice and friendly.   The deco is traditionally Japanese with smaller private room. The place is small can sit probably 30 people!   I can't wait to try some of the cooked dishes at Mi-NE! And Lunch Specials here ROCKS!!   They accepts Amex, Mastercard and Visa!"}
{"business_id": "M6r6jKPr5tcpdatDn9K5lA", "stars": 1.0, "text": "Mike, I am so Sorry! I don't think it will work out for us and there is not going to be a second date ever!  Your BBQ Pork and Roasted Duck with Rice ($5) was one of the worse Chinese BBQ I had! I know, it is just suppose to be a cheap date, I am expecting too much for $5 tax in lunch date  that includes a daily soup and you even throw in some tofu....  The rice was not hot... it was not cooked freshly! BBQ Pork was like this orange colour with no taste at all! The gravy on top was like a mushy filmed formed on top of pork and duck!  BTW, you are also such a bad dresser in need of a bath! Sticky floors, dirty tables....  I took off in the middle of our date, not because I have an emergency! I just can't do it!!  Bye!   Please don't text, email or bbm me EVER!"}
{"business_id": "KjuvzMveMCyUqbQy3dBuBA", "stars": 1.0, "text": "Rich II looked like it is in their preparation stage when I came for lunch today. Mind you they do have a sign in the front saying they were doing a trial run giving customers 10% off.  The interior is roomy and spacious. The tables are set around a fountain giving the feel of a European courtyard.   The price of  lunch menu which is a la carte is a lot more than anyone in area would have wanted to pay, with a main salad at $14! Or you can opt for the set at $35. Lunch set for $35? I  I really don't mind if the food is good.  A prime rib sandwich ($17) was meh.  A lot of chewy tendon. The best part was the extra spicy pickle. The so called truffle chips were overcooked...  The table setting is of dollar store quality.. I have not seen a plastic bread basket pretend to be wicker as yet in any restaurant at this price point. The side plate was dirty. Everything reminds me of trying to look classy by using inferior material.  I have nothing against Chinese people opening high end steakhouse. But in order to be successful a lot of work and attention to little details is needed. Hiring a manager that has real high end restaurant experience training the waitstaff for sure would help.  And don't serve your customers hot water in a cup if they don't request that. I just hate drinking plain hot water nor I speak or understand Mandarin much."}
{"business_id": "fyekfJA4hXNgMQ09HL9WIA", "stars": 5.0, "text": "I have to confess I am a pasta monster. I would be happy eating lunch everyday here at Famiglia Baldassarre for the rest of my life. Sadly they only open 4 days a week.  Arrived early before the place was opened on a overcast chilly afternoon. The wait was minimum and we got to order the 2 pasta of the day, a Crudo and Asparagus to share.   Nothing can replaced the taste, the mouth feel of freshly made pasta. Their menu changed daily so you always in for a treat and wondering what you going to have for lunch today.  The Prosciutto crudo is a steal at the price. Must order!   Sometime truffle might be available? Truffle is just magical.  Everything tasted so fresh, pure and wholesome. A taste of love and caring prepared by an Italian mamma?  Just go and you find out what you had been missing in your life. Make sure you bring Cash!"}
{"business_id": "kT7H1j57NW5YNLuWHPUAUg", "stars": 1.0, "text": "Should I feel a little awkward? I walked into this newest bubble tea place for a cool drink and some chill time.. and I came face to face with a crying baby.  Th only sectional sofa in the shop was transferred to a baby pen by the owner and friends.   If the drink tasted at least decent, I won't be complaining. But their Taro Milk tea with taro ($4.99+$0.50) was just pathetic and that's the cheapest item on the menu. And made Chatime pricing feels like a bargain.  Free popcorn was meh...  Not a relaxing atmosphere listening to baby whining and ladies gossiping... The last draw was when they started trimming baby's nails in front of me!!   Not ever coming back.... There are so many other choice in the area."}
{"business_id": "jTZYireK6pnPb6Rni0jygw", "stars": 5.0, "text": "Wow Sushi, what a cheesy name! But really Wow means harmony in Chinese, a reflection of the Chinese roots of the Chefs/Owners of this restaurant!  WOW!!! I was so impressed!! I am WOWED!   Disclaimer: if you are into traditional Japanese cuisine, you might not like Wow because Wow is really Japanese cuisine with a modern twist!  Chirushi Lunch $13 is one of the best I ever had, at least at this price point! The selections of fish, the presentation, the freshness and the attention to detail. The waitress named all the fish for me when she served me.   Salmon so fatty from Greece, Seared Tuna and Butter Fish garnished with crispy fried garlic done perfectly, even the Tamago which I usually dislike was done perfectly! The presentation was so good and you can tell thoughts were put in to how the different ingredients would affect the eating experience.   While I enjoying my lunch, with every bite I couldn't stop thinking this is much better than Zen, Le Michi and dare I said better than YUZU! When I told the waitress that, she had this big smile on her face! Apparently the young sushi chef used to work at Yuzu and a lot of other finer Japanese restaurants  before he and his brother decided to has this sushi place!!  Keep up the good work, young chef!! I will be back and try your skills again! And next time I will be having some sushi with sake as they are getting their LCBO licence soon!  Using my limited Japanese vacobulary I said goodbye and thank you! The chef was even bowing at me in utmost respect! I think I should be bowing to him for giving me such a wonderful experience!   * A suggestion for area of improvement: the tea!! The tea was really weak and tasted like water... use better tea leaves!"}
{"business_id": "b959iSBSYuuhtiEmv6VIQA", "stars": 5.0, "text": "Ontario Spring Water Sake Company is a sake brewery in Toronto brewing using water from Northern Ontario....   Love the concept! Love the location! Love the set up! I just love the whole idea...   The staffs are all really nice and patient and explained each of the sake we tasting and how it was made... It was really enjoyable and I suggest the Tasting Flight ($10) if you are not too familiar with sake.   Even for non drinkers, OSWSC has something for everyone! Sake Kasu was used to make marinade, salad dressing and even desserts! I was all excited when I saw they have Goma ice cream when I saw the sign.. but unfortunately it was all sold out!!!   I need to come back to try the Goma....."}
{"business_id": "GItaJd9S14jY0FseuJzOEw", "stars": 1.0, "text": "What a Bagel's Bagel is A-OK.. better than Tim Horton.   There are 2 areas, one is set up like a bakery with cookies, bread, bagels and made to order sandwiches to go. The other area is more like a sit down restaurant serving light sandwiches for lunches and breakfasts.   The Breakfast Bagel ($6.99) with home fries was quite good.. bagel toasted crispy on the outside and soft and chewy inside.   Coffee ($1.99) was not fresh... doesn't matter how many cream I add in, it is still bittery dark... hmmmmm   The decoration is quite comfortable and overlooking the parking lot...   But why that 1 star??   The waitress is one of the rudest one I have... after I asked for my bill.. I just want to finish my coffee.. and then she trying to make me leave so a group of 5 ladies can use my single table while half of the tables in the restaurant is empty..   I asked are you trying to kick me out.. she told me yes... WTF is this?"}
{"business_id": "yIE9RYGHEk8A9RxrSVgbdQ", "stars": 1.0, "text": "I am not a big fan of AYCE. The selections was quite good at first glance. I came here based on recommendation from my coworkers.  We were lucky to be seated right next to the sushi counter and when we saw how they made their sushi rice, we lose all our appetite!  The sushi rice were all fed into a machine where little dumpling of rice coming out from the other end.... and then the so call sushi chefs put the pre sliced fish on top of the rice.  Just like the previous viewers they messed up our orders too...  I would not come back to eat here anymore!"}
{"business_id": "_xavJB9Uia1CsPDlGFw5Qg", "stars": 1.0, "text": "This is one of the worst vietnamese Pho place in the area!!  Please don't bother going there!  Nothing is good there...(at least all the dishes I ordered!) And from my previous reviews you can tell I am not too picky!  There are so many different restaurants choice in this plaza... you will be happy you did not come here!"}
{"business_id": "IVY1ctTw5ctooLmmcP6-nw", "stars": 5.0, "text": "Chocolate = Work of Arts?  Here at The Chocolate Lab, that's how Chocolate is prepared and displayed as such.  Every piece looks so pretty and so colourful. I just feel like order every single one of those. But sadly, good chocolate does come with a cost and I do have a budget.  Staff here is super friendly and cheerful.  I took them back to my hotel and I just want to eat them all as bedtime treats! But sadly, I have to share with someone the next day......."}
{"business_id": "hJPdrw2W4FCO5Z9KHrOOtA", "stars": 1.0, "text": "R Kitchen, a newcomer to the area. It is not really new as it atmosphere and menu is relatively similar to Mirage and Symposium.   It describes itself as moderately priced trendy International / global restaurant located in the Richmond Hill area of York Region. R Kitchen specializes in International / global cuisine and features breakfast, brunch..  Maybe being trendy is having hip music pumping through the speakers? The menu here is boring and pricey.   Steak Sandwich ($14) serves with a market salad was medicore as best. The salad was lifeless even without the dressing on. Steak was cooked medium rare but was chewy and hard with all the fat and trimming still on.  I told the waitress about the salad and she said the chef insisted that it was fresh... so don't order salad, I warned you!  During late afternoon just don't sit in the solarium area, the sun can be blinding and bring your sunglasses. At first my waitress  would not let me move, but I was persistent. The restaurant was empty, why can't a paying guest move to a better and comfortable area?!  The experience at R Kitchen was just disappointing. I doubt I would ever be back."}
{"business_id": "omcQohJjl8jDIhLo0M6_cA", "stars": 1.0, "text": "What a disappointment! What a big mistake!!  Mikado really should not have switch their menu to AYCE! The quality of the food really went down so much that it is not worth my while to go back.  I was there on a Saturday evening and the restaurant is 2/3 full. We were seated promptly. However it took so long for our food to arrive. The kitchen is so slow, since there is only 1 guy working there!   The steamed egg that was so good before now just a 1/2 full with no seafood and the egg all crumbled into pieces.. The dumplings are the worse I ever ate, they are so hard and dried. Sigh.........  The waitress tried so hard but nothing much she can improve their situation because when you have only 3 workers (1 sushi chef/1 Robata chef/1 Kitchen chef), the food took so long to arrive. The shrimp tempura still the best I ate in any AYCE took over 1 hour to arrive!  The oyster is still good but now it is a lot smaller size than before.  The spider roll and green dragon roll were well prepared, the crab and the eel inside tasted so fresh.  I feel really sad how Mikado being a restaurant with so much potential become one of those AYCE....."}
{"business_id": "6p4Cu__KMSpDUqX4qVpCMQ", "stars": 1.0, "text": "High End Italian Restaurant is hard to survive in this area... where Indian food takes out rules!  Ferrovia Ristorante has been closed for the longest time!  This location still open though! http://www.yelp.ca/biz/ferrovia-ristorante-thornhill"}
{"business_id": "mmazCP1ZH0QsUqDS6OivFA", "stars": 5.0, "text": "If I have a Jen K's Top 10 Restaurant List, Joe Beef would definitely be on it.   And in fact, I might even able to say My Last Meal on Earth I want to have it here. (Yelp's profile question and they do serves uni!)  I have been to Liverpool House, Joe Beef's sister restaurant right next door but Joe Beef is the real deal.  The menu is seasonal but interesting. A mixture of seafood and meat and even vegetables. And of course foie gras!  Everything we ordered were amazing. And the wait staff is just so knowledgeable with the menu and able to make awesome recommendations.  The vibe is relaxing especially out on the back patio on a nice summer evening.   And of these for a reasonable price!   Just make sure you make a reservation ASAP, Joe Beef is just so popular and definitely worth all the hype!"}
{"business_id": "96X4OwboB2qCLY7tQ20wMg", "stars": 1.0, "text": "The first 20 minutes when you are in the Rainforest Cafe, it is cool..  After that all the animation became old and stale, even can drive you crazy!!  The food here are expensive and does not worth the price they are charging.   And of course this is a family restaurant, there will be tons and tons of kids... if you do desire a more adult dinning experience, please stay away!"}
{"business_id": "M6sS5Llw0FnJu1J3b78WOg", "stars": 5.0, "text": "The BEST butter tart I ever have!   The Maid's Cottage's butter tarts are just so good! The crust so flaky and buttery! The fillings so smooth and silky like melted caramel!   I ate mine so fast while my Yelp friend kept admiring his! I almost want to grab it from him and just eat it!!  I can eat a half a dozen of these tarts with no problem...until I find out their calories and sugar count. How can these little delicious pastry so unhealthy but this sinfully indulgence is worth every single calories!  4 different flavors to choose from Plain, Pecan, Raisin and Currant  The Maid's Cottage now is my must visit stop next time I am up in Newmarket!"}
{"business_id": "QxnwaNgY6_e88SBfmT6k1w", "stars": 1.0, "text": "Richmond Court Restaurant Bakery is 2 store on the left of Richmond Court Restaurant sandwiching Lucullus Bakery.  If you look through the front window from outside, you will not see anything because they are all fogged up!! When you walk in, you will know why... there are steamers warming the dim sums and the rice they sell. Dim Sums are $1.75 per order and Rice with chicken/beef/spare ribs are $3.50 with tea or coffee.  There are also Chinese buns and Western style cakes... I have to say the slice cakes are the smallest I ever seen! priced between $1.50 to $1.70, they are so thinly sliced!! It is an embrassment when you trying to get it for your friends and they wondering how cheap I am when the cake slice is so small!  The lady that served me just give me that tiny cake slice and asked me to hold on to it and go pay at the cashier?!! Gee... at least help me put it in a bag or something..   There are some seatings if you do decide to eat in... but I don't think it will be a pleasure experience, since you will smell like dim sum after and your glasses might be all fogged up because of the steam...  Cash Only!"}
{"business_id": "OAtG5YWSfqR10OmhHmDBBQ", "stars": 1.0, "text": "Coconut Island Restaurant does has lunch time specials and combos and I love spicy food and I decide to give it a try.  When I walked in the restaurant at 12:15 pm on a weekday, it was empty.. oh not a good sign. This place does have a funny and musky smell to it. and the interior of the restaurant is quite dark.  There are over 20 different lunch specials you can choose from starting from $6.50.  I decide on the Penang Pawn Noodle Soup for $6.50. I request for extra spicy. Yes the kitchen is slow! I waited over 15 minute for my noodle to arrive. There are 2 tiny shrimps on top, with a few tiny piece of chicken, tofu and half an egg. The broth is NOT spicy at all... and it tasted pretty bland. Usually Malaysian food has a really strong taste and flavour and my noodle has none of that!   OK it taste like something I a lousy cook would have make it at home! If I want my own cooking.. I will have stay home!  There is only 1 waitress working during lunch time.. and to serve the 3 tables with 5 customers and she is so slow...... can't imagine if it is a full house.. but it is hard to think that it will be busy with the slow service and the quality of the food!  Don't go there if you are in a rush during lunch time! You will be so frustrated!  They accepts Cash only!"}
{"business_id": "0uJ9zHtOTIdT2woPWEibnQ", "stars": 1.0, "text": "Xe Lua at Richmond Hill is closed and replaced by Pho Hoang Kim (Golden Way) Vietnamese Restaurant.  I have not been to this Xe Lua location before, I cannot really comment about that. But I have to say Pho Hoang Kim is not really an improvement, since it is not going to be the Pho joint I would have recommend my friends to go to.  Basically, they just change the business signs in the front to another name. The interior stayed the same without any renovation. This place looks so runned down.. so depressing...  The tea are served in foam cups?? Why you served your hot tea in foam cups... can you get some teacups from the dollar store?  I order the small Pho with raw beef and beef balls ($5.00) and a iced milk tea ($2.50).   Why are you serving my iced drinks in plastic cups?? Am I in a food court or something? The milk tea is too sweet without any taste of tea.. you sure it is not a colour sugared drink??  The Pho is ok... the broth is not hot enough and does not have any flavour except being salty. The beef is not raw.. is more cooked than well done... the only good thing is that the noodle is the fresh varieties.  Pho Hoang Kim, you know even if you change your name and you still serves nasty food.. no one is going to come!  They accepts Visa.  No Lunch Specials!"}
{"business_id": "MIkZkL5xJGBd-4nkMyVTnQ", "stars": 1.0, "text": "I was been calling Coffeeholic's phone a couple of time to verify their business hours, but no answers!!  This afternoon I drove by the store since I am in the area.. A Huge FOR RENT sign is up!! :(  Business is CLOSED!!"}
{"business_id": "Y5-Gphj7DNIav1ZADUip-A", "stars": 5.0, "text": "Marche Jean-Talon is definitely the highlight of my Montreal trip.  Even without all the stalls and businesses open in the middle of winter, it is a great experience.. I can imagine how it is when the weather is nice and warm....  Everything that a foodie dream of.. you can be a cook or just like to eat.. you will have an amazing experience!   Fresh produces, Vegetables, Fruits, Meat, Baked Goods..... I want to try everything!!   I wish Toronto has a market like this... simple and unpretentious for the local people to shop and not a tourist trap!"}
{"business_id": "vWzbEdsyyj4ts_3Dp8owQQ", "stars": 5.0, "text": "Yan's Soy Food has the best Tofu pudding in GTA!  They used to be in Market Village and now moved to this location.  Same great food, same great prices! All their soybean products are freshly made daily in house from scratch.  It is a lot smaller with only 3 seats so I suggest having your dessert to go.  Ample Parking."}
{"business_id": "1HWH_BE_wMfX88cRoH-NCQ", "stars": 5.0, "text": "Japanese food is more than just sushi!   Sakawa Cafe serves Japanese Style Western Food (yōshoku). and comfort food (ramen, rice bowl etc). Price are really reasonable with items priced under $10.  Warm and friendly service. The lady that working the front of the house is so cheerful and homey.  We ordered: Katsu Don ($8.50) Pork Katsu and Egg on Rice Japanese Style Doria ($8.50) Cream Sauce with Cheese on Ketchup Rice  There is an option for adding $1 to make it a combo with salad and soup Portion was just perfect and all prepared with care.   They also serves espresso based and hand drip coffee using Social Coffee beans.  Sakawa Cafe is just amazing!  One of the most authentic Japanese Cafe in Toronto. So down to earth and without a sense of pretentious!"}
{"business_id": "sK_SN5q7F-VkZUEPxN_MFg", "stars": 5.0, "text": "Danish Pastry the way it should be!   If you ever wonder why everyone raves about how good their pastry in Denmark, I really suggest coming here for a taste without flying there! This is as close as the real thing!  They imported a special machine that able to make a fresh baked Danish dough with no less than 27 melt-in-your-mouth layers. 27 layers! One bite is all you need, specially you love how light and flaky it is!  We got 6 different ones to try. They were so good and we finished 3 on the spot and I just kept staring at them when I got home as I just want to have them all right away.   I already request to have a stop next time when I am in the area or just make a special detour. They are just that good!  PS. Try one of their coffee make fresh from the special beans imported from Copenhagen, perfect to go with one of their pastries!"}
{"business_id": "Y5-Gphj7DNIav1ZADUip-A", "stars": 5.0, "text": "Finally back again to Marche Jean-Talon on a nice sunny Summer day.  Fresh Seasonal Vegetables and Fruits! Free samples available and the tomatoes just so sweet!   Great place to pick up some prepared food for picnic or some fresh vegetables for cooking.  Tacos?   Oysters?  Cured Meat?  Goat Cheese?  Mushrooms?  Everything so fresh! I wish I can come shopping here everyday!"}
{"business_id": "QgdO29fGB-eBNe1BzHR7YQ", "stars": 5.0, "text": "I love DEQ!!  I love my experience so much that I wish my Yelp Drinking Buddy showing up late so I can keep having my mixed drinks and daydreaming I am enjoying my pre dinner drink at one of the resort!!  Waiters speaks with an European accent?? Where do they find all these waiters?? Polite, friendly and cough cough good looking?!!  Those wicker chaise loungers in the patio!!!... oh so comfy...great for daydreaming.... A view of CN Tower... Priceless!!  I don't really mind paying a premium for the experience...   Raspberry Collins ($15) and Turkey Meatball Slider ($18)  And I think from now on I going to meet my always late Yelp Drinking Buddy at DEQ, he can take his sweet time........."}
{"business_id": "VnTKMU-yGiFvohMQy-Q9RQ", "stars": 5.0, "text": "As usual, I walked right passed Sense Appeal Coffee Roasters... before I realized my mistake... The entrance is like a business building lobby... yes it is really a business building lobby with bicycle couriers constantly walking in and out!!   The interior of Sense Appeal Coffee Roasters is a big contrast to the building itself.. as it is really rustic with mosaic flooring showing extreme wear and tear, wooden bar counter that has 6 seatings, high ceiling...   I settled for an Americano ($2.25) with the AS roast.. which is their strong nutter roast that they used for all the other espresso beverages.. There are in fact 4 different type of roasts, some more fruity and some nutty..   For the to stay version, my Americano was dark, smooth and with bold full bodied flavour, served in the proper mug... just chill.......and enjoy the moment!   There are more seating in the lobby side, but it is not as good an atmosphere as hanging out in the main area and watch the baristas at work! Trust me, they really know what they are doing!  And I will definitely be BACK!!"}
{"business_id": "OhA9bbcQ20X2g5Iwq9Hzyw", "stars": 5.0, "text": "I love Pie Shack! I love Pie Shack! I love Pie Shack!  Personally I am not a pie person because I ate so many bad pies.. those nasty supermarket ones, the horrible pies that served in so many restaurants as desserts... all my pie nightmare!  The Strawberry and Cream pie I have at Pie Shack is so so tasty! The crust is so thin, so fluffy, so buttery...the filling is not too sweet but hmmm match perfectly with the pie and god forbid the ice cream!  What makes enjoying a piece of pie so special at Pie Shack is the owner. He is such a great host.. making us feel at home, moving us to the comfy sofa...heated up our pie to perfection and make sure all our cups are never empty without asking! I feel I am in someone porch or a country home enjoying a leisure lazy afternoon ..  If you do decide to drop by, please come early especially on a weekend. We were there at 3 pm or so and almost all the pies are gone!! Some customers has been turned away disappointed...  I have so looking forward to come back to try the other pies they offer!!  They accepts Visa and Mastercard."}
{"business_id": "uAAWlLdsoUf872F1FKiX1A", "stars": 5.0, "text": "I dropped by Bang Bang on a weekday winter afternoon. There was no lines. There was no one really but me and the ice cream. The legendary best ice cream in Toronto.  So many different unique flavours. The nice staff let me try a few, and in fact I do want to try them all?! I already set my mind on Totaro since I love ube and everything purple.  A scoop of Totaro in a puff ($4.75) was just so so deliciously good. The ice cream has such intense flavour and I felt like I was in somewhere tropical just for the moment... The puff was buttery and tasty.  Would I have lined up for 45 minute for this? Probably not. So I better come back to get some Bang Bang before the crowd shown up again. I would eat ice cream as good as this in the depths of winter."}
{"business_id": "fh8a_k9oslEDSHbmJLzUrQ", "stars": 5.0, "text": "I have been going to Kekou on Baldwin Street numerous times and love all the unique flavour especially Black Sesame and Durian! Probably one of the best durian gelato/ice cream I had, the flavour is so intense is like you eating the real fruit itself.  I am of course excited that Kekou opens another location. Bigger, Better and Opens Year Round! I love eating gelato year round especially unique Asian flavours; Roasted Oolong Tea! This maybe my newest favourite aside from Durian.  Soft Serve, Hot Drinks (tea and latte) and Even Creme Burlee (Durian flavour!)   Service always warm and friendly. And you can get a sample of almost every flavour before you decide to which one or two but trust me, it is not easy."}
{"business_id": "Cz_wUs6D7786FfQzpQELog", "stars": 1.0, "text": "They are CLOSED!"}
